public class Main {
    public static void main(String[] args) {
//Дано цклое число num. Необходимо написать программу, которая выводит на экран таблицу умножения num  до 10

      /*int num = 5;
        int mult = 10;
        int i= 0;
        while (i <= mult) {
            System.out.println(num + " * " + i + " = " + num * i);
            i=i+1;
        }*/

        int startIndex;
        int endIndex;
        String
        char ch=str.charAt(index);
    }
    }